Dlubal.RFEM5.ILoadCombination
Interface for working with load combination

Dlubal.RFEM5.ILoadCombination.GetData
Gets load combination parameters.
Returns: Load combination parameters

Dlubal.RFEM5.ILoadCombination.SetData(System.UInt32@)
Sets load combination parameters.
Combination: Result combination parameters

Dlubal.RFEM5.ILoadCombination.Delete
Deletes load combination.

Dlubal.RFEM5.ILoadCombination.HasResults
Indicates if load combination has any results.
Returns: True if the load combination has any results, otherwise false.

Dlubal.RFEM5.ILoadCombination.GetAnalysisParameters
Gets analysis parameters.
Returns: Analysis parameters

Dlubal.RFEM5.ILoadCombination.SetAnalysisParameters(System.UInt32@)
Sets analysis parameters.
Analysis: Analysis parameters

Dlubal.RFEM5.ILoadCombination.GetIncrementallyIncreasingLoading
Gets incrementally increasing loading parameters
Returns: Incrementally increasing loading parameters

Dlubal.RFEM5.ILoadCombination.SetIncrementallyIncreasingLoading(System.UInt32@)
Sets incrementally increasing loading parameters
Loading: Incrementally increasing loading parameters

Dlubal.RFEM5.ILoadCombination.GetLoadings
Gets list of loadings in the load combination.
Returns: Array of loadings in the load combination.

Dlubal.RFEM5.ILoadCombination.SetLoadings(System.UInt32@)
Sets list of loadings in load combination.
Loadings: Array of loadings to be set in the load combination.